In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt 
import math

In [5]:
salary = pd.read_csv('../Labs files/course-files/StackOverflowDeveloperSurvey.csv',
                    usecols=['Salary']).dropna()

In [6]:
salary.head()

      Salary
2   113750.0
14  100000.0
17  130000.0
18   82500.0
22  100764.0

In [16]:
salary.sort_values('Salary', inplace=True, ascending=False)

In [18]:
salary.head()

         Salary
31600  197000.0
27943  195000.0
6743   195000.0
41398  195000.0
1696   195000.0

In [29]:
salary.sort_values('Salary', inplace=True)

In [30]:
salary.head()

       Salary
51144     0.0
44841     0.0
23907     0.0
4517      0.0
2951      0.0

In [34]:
salary.sort_index(ascending=False, inplace=True)

In [36]:
salary.head()

              Salary
51390   40000.000000
51387   58000.000000
51382   32258.064516
51378  107526.881720
51371   74193.548387

In [37]:
max_salaries = salary.sort_values('Salary', ascending=False).head(100)

In [38]:
max_salaries

         Salary
31600  197000.0
27943  195000.0
6743   195000.0
41398  195000.0
1696   195000.0
...         ...
41214  170000.0
48222  170000.0
29662  170000.0
29971  170000.0
14805  170000.0

[100 rows x 1 columns]

In [39]:
min_salaries = salary.sort_values('Salary').head(100)

In [46]:
min_salaries.round(2)

       Salary
2951     0.00
4517     0.00
51144    0.00
23953    0.00
44841    0.00
...       ...
26905  176.19
33212  178.78
50569  198.21
48674  198.65
1077   200.00

[100 rows x 1 columns]

In [45]:
max_salaries.mean().round(3)

Salary    180198.105
dtype: float64

In [43]:
min_salaries.mean()

Salary    67.083889
dtype: float64